[
  {
    "jobName": "razorpay",
    "position": "Senior Software Engineer (Backend)",
    "company": "Razorpay",
    "website": "https://razorpay.com/",
    "location": "Bengaluru, Karnataka",
    "from": "Nov, 2021",
    "to": "Current",
    "desc": [
      "Developed multiple features for internal \"Auto Recon Tool\", handling reconciliation of millions of txns for payments, refunds, chargebacks and settlements everyday.",
      "Also, developed features responsible for anomaly detection like money leaks, and fraudulent txns in ART.",
      "Reduced internal data fetching scripts time from greater than 2 hours to under few minutes. With this fetching jobs now work with 10% of initial cost.",
      "Reduces data ingestion time in spark pipeline by 10-20% by changing few ingestion strategies.",
      "Developed Reconciliation and Settlement Service module from scratch for ONDC (Open Network for Digital Commerce) initiative.",
      "Implemented fraud detection mechanism on commission payouts to prevent loss/abuse. This helped identify monthly payouts up to 3.5 million. (Net revenue loss)",
      "Setup alert and monitoring framework for workers which later helped in detecting org-wide outages before creating impact on payments.",
      "Developed & Managed commission module for various payment products at scale of 300 TPS for commisions create and at 900 TPS for its pricing.",
      "Executed successful migrations of critical operations without interruption of services, (user roles migration)",
      "Managed P2 incident (customer experience breakage) from triage to RCA."
    ],
    "comments": {
      "desc": [
        "Payment Products: QR, SmartCollect, E-Mandate, CAW, and PaymentLinks",
        "Async Workers Outage: leading delays in balance updates, payouts, refund processing and many more capabilities.",
        "CAW: Charge at will",
        "With fraud detection system we identify fraudulent subM added to Groww (650Cr GMV) and prevented 35L commissions payout.",
        "Moved from owner to view only role",
        "GupShup behaviour change leads to cascading failures in our system. We were able to identify the issue and get it fixed within 15 minutes"
      ]
    }
  },
  {
    "jobName": "vimeo",
    "position": "Software Engineer (Full Stack)",
    "company": "Vimeo",
    "website": "https://vimeo.com/",
    "location": "Bengaluru, Karnataka",
    "from": "March, 2021",
    "to": "Nov, 2021",
    "desc": [
      "Developed tagging pipeline (pre-download) to dynamically add EXIF metadata to MP4 files.",
      "Integrated Vimeo-Create with partners such as ConstantContacts and Facebook.",
      "Enhanced code generation scripts for internal routing files.",
      "Fixed several issues in Vimeo-Create integration SDK, including overlays and post-message communication."
    ]
  },
  {
    "jobName": "peak",
    "position": "Software Engineer (Full Stack)",
    "company": "Peak.ai",
    "website": "https://peak.ai/",
    "location": "Jaipur, Rajasthan",
    "from": "Aug, 2018",
    "to": "Jan, 2021",
    "desc": [
      "Improved frontend delivery through code-splitting and implementing an effective caching strategy (edge caching and object expiration).",
      "Responsible for complete authentication and authorization flow, across all services including user management and RBAC (IAM).",
      "Developed a TCP proxy for AWS Lambda use cases and PostgreSQL communication. (Inhouse RDS proxy)",
      "Developed connectors (plugin for internal pipelines) for data fetching through FTP/SFTP.",
      "Developed micro-services with AWS services like AWS Lambda, DynamoDB, S3, IAM, and SQS.",
      "Developed a custom component library to move presentational logic out of the business application.",
      "Pipeline for automated data fetching from mintuk.bvdinfo.com and Big Query."
    ]
  }
]