[
  {
    "jobName": "razorpay",
    "position": "Senior Software Engineer (Backend)",
    "company": "Razorpay",
    "website": "https://razorpay.com/",
    "location": "Bengaluru, Karnataka",
    "from": "Nov, 2021",
    "to": "Current",
    "desc": [
      "Developed RSP module from scratch for ONDC (Open Network for Digital Commerce) initiative. (RSP: Reconciliation and Settlement Service Provider)",
      "Contributed to ART (Auto Recon Tool), which is responsible for anomaly detection, preventing money leaks and payments verification.",
      "Implemented fraud detection mechanism on commission payouts to prevent loss/abuse. This identified incorrect monthly payouts up to 35L. (Immediate loss from NR)",
      "Setup alert and monitoring framework for our workers which later detected org-wide outage in async workers.",
      "Developed commissions generation capability for various payment products (QR, SmartCollect, E-Mandate, CAW, and PaymentLinks).",
      "Executed successful migrations of critical operations without interruption of services, (user roles migration)",
      "Managed P2 incident from start to finish (triage to RCA)."
    ],
    "comments": {
      "desc": [
        "Async Workers Outage: leading delays in balance updates, payouts, refund processing and many more capabilities.",
        "CAW: Charge at will",
        "With fraud detection system we identify fraudulent subM added to Groww (650Cr GMV) and prevented 35L commissions payout.",
        "Moved from owner to view only role",
        "GupShup behaviour change leads to cascading failures in our system. We were able to identify the issue and get it fixed within 15 minutes"
      ]
    }
  },
  {
    "jobName": "vimeo",
    "position": "Software Engineer (Full Stack)",
    "company": "Vimeo",
    "website": "https://vimeo.com/",
    "location": "Bengaluru, Karnataka",
    "from": "March, 2021",
    "to": "Nov, 2021",
    "desc": [
      "Developed tagging pipeline (pre-download) to dynamically add EXIF metadata to MP4 files.",
      "Integrated Vimeo-Create with partners such as ConstantContacts and Facebook.",
      "Enhanced code generation scripts for internal routing files.",
      "Fixed several issues in Vimeo-Create integration SDK, including overlays and post-message communication.",
      "Developed support for JWT interoperability for cases where 3rd party cookies were blocked."
    ]
  },
  {
    "jobName": "peak",
    "position": "Software Engineer (Full Stack)",
    "company": "Peak.ai",
    "website": "https://peak.ai/",
    "location": "Jaipur, Rajasthan",
    "from": "Aug, 2018",
    "to": "Jan, 2021",
    "desc": [
      "Contributor of user management, authentication and RBAC services (IAM). Responsible for complete authentication and authorization flow, across all services.",
      "Developed a TCP proxy for AWS Lambda use cases and PostgreSQL communication. (Inhouse RDS proxy)",
      "Developed connectors (plugin for internal pipelines) for data fetching through FTP/SFTP.",
      "Improved frontend delivery through code-splitting and implementing an effective caching strategy (edge caching and object expiration).",
      "Developed a custom component library to move presentational logic out of the business application.",
      "Hands-on experience with AWS services like AWS Lambda, DynamoDB, API Gateway, S3, Cloudfront, EC2, IAM, and SQS."
    ]
  },
  {
    "jobName": "peak_intern",
    "position": "Software Engineer Intern",
    "company": "Peak.ai",
    "website": "https://peak.ai/",
    "location": "Jaipur, Rajasthan",
    "from": "May, 2018",
    "to": "Jun, 2018",
    "desc": [
      "Pipeline for automated data fetching from mintuk.bvdinfo.com and Big Query."
    ]
  }
]