[
  {
    "jobName": "razorpay",
    "position": "Senior Software Engineer (Backend)",
    "company": "Razorpay",
    "website": "https://razorpay.com/",
    "location": "Bengaluru, Karnataka",
    "from": "Nov, 2021",
    "to": "Current",
    "desc": [
      "Founding engineer for Recon SAAS. Built from scratch with multi-tenancy support.",
      "Developed features for internal reconciliation tool, processing millions of transactions daily [payments, refunds, chargebacks, payouts, settlements].",
      "Optimized data fetching to reduce run time from over 2 hours to under a few minutes, reducing costs by 90%.",
      "Developed the Reconciliation and Settlement module from scratch for the ONDC (Govt. of India initiative).",
      "Built a fraud detection system to prevent losses and abuse in commission payouts, identifying losses up to INR 3.5 million monthly.",
      "Scaled the commissions module to handle upto 300 TPS for commissions creation and upto 900 TPS for commissions pricing calculations.",
      "Automated commissions generation for payments products like PaymentLinks, QR, SmartCollect, E-Mandate, and CAW.",
      "Implemented automated disbursals of commission invoices, leading to an increased NPS score for the partnership module.",
      "Established monitoring and alerting for async workers to enable early detection of organization-wide outages before customer impact.",
      "Successfully executed zero-downtime migrations for critical operations, such as user role migration, ensuring seamless transitions."
    ],
    "comments": {
      "desc": [
        "Payment Products: QR, SmartCollect, E-Mandate, CAW, and PaymentLinks",
        "Async Workers Outage: leading delays in balance updates, payouts, refund processing and many more capabilities.",
        "CAW: Charge at will",
        "With fraud detection system we identify fraudulent subM added to Groww (650Cr GMV) and prevented 35L commissions payout.",
        "Moved from owner to view only role",
        "GupShup behaviour change leads to cascading failures in our system. We were able to identify the issue and get it fixed within 15 minutes"
      ]
    }
  },
  {
    "jobName": "vimeo",
    "position": "Software Engineer (Full Stack)",
    "company": "Vimeo",
    "website": "https://vimeo.com/",
    "location": "Bengaluru, Karnataka",
    "from": "March, 2021",
    "to": "Nov, 2021",
    "desc": [
      "Built a tagging pipeline to dynamically add EXIF metadata to MP4 files before download.",
      "Integrated Vimeo-Create with partners like Constant Contacts and Facebook.",
      "Enhanced code generation scripts for internal routing files.",
      "Fixed issues in Vimeo-Create SDK integration including overlays and post-message communication."
    ]
  },
  {
    "jobName": "peak",
    "position": "Software Engineer (Full Stack)",
    "company": "Peak.ai",
    "website": "https://peak.ai/",
    "location": "Jaipur, Rajasthan",
    "from": "Aug, 2018",
    "to": "Jan, 2021",
    "desc": [
      "Developed internal workflow orchestration tool, built over argo workflows.",
      "Developed data connectors for ETL pipelines to fetch data from sources like FTP and SFTP.",
      "Contributed to authentication, authorization, and RBAC (role-based access control) flows across all services.",
      "Developed a TCP proxy for AWS Lambda and PostgreSQL communication. (Inhouse RDS proxy alternative)",
      "Improved frontend delivery through code splitting and implementing effective caching strategies and object expiration.",
      "Developed serverless microservices leveraging AWS services like Lambda, DynamoDB, S3, IAM, and SQS.",
      "Created a custom UI component library to extract presentational logic from the core business application.",
      "Built data pipelines to automatically ingest data from sources like mintuk.bvdinfo.com and BigQuery."
    ]
  }
]